In [2]:
import pandas as pd
import numpy as np

In [3]:
data = [{"Name":'Yasir',"Scince":40,"Math":50,"Urdu":60,"English":70,"Sindhi":90},
        {"Name":'Ahmed',"Scince":59,"Math":90,"Urdu":None,"English":80,"Sindhi":91},
        {"Name":'Ali',"Scince":40,"Math":50,"Urdu":60,"English":70,"Sindhi":90}]
df = pd.DataFrame(data,index=['std-1','std-2','std-3'])

In [4]:
df

        Name  Scince  Math  Urdu  English  Sindhi
std-1  Yasir      40    50  60.0       70      90
std-2  Ahmed      59    90   NaN       80      91
std-3    Ali      40    50  60.0       70      90

In [5]:
pd_series = pd.Series([2,4,5,7,8,0],index=['a','b','c','d','e','f'])

In [6]:
pd_series.pop('e')

np.int64(8)

In [7]:
pd_series

a    2
b    4
c    5
d    7
f    0
dtype: int64

In [8]:
df.drop('Math',axis=1, inplace=True)

In [9]:
df.drop('std-1', axis = 0)

        Name  Scince  Urdu  English  Sindhi
std-2  Ahmed      59   NaN       80      91
std-3    Ali      40  60.0       70      90

In [10]:
df

        Name  Scince  Urdu  English  Sindhi
std-1  Yasir      40  60.0       70      90
std-2  Ahmed      59   NaN       80      91
std-3    Ali      40  60.0       70      90

In [11]:
df.dropna(axis=1)

        Name  Scince  English  Sindhi
std-1  Yasir      40       70      90
std-2  Ahmed      59       80      91
std-3    Ali      40       70      90

In [12]:
df.dtypes

Name        object
Scince       int64
Urdu       float64
English      int64
Sindhi       int64
dtype: object

In [13]:
df.describe()

          Scince  Urdu    English     Sindhi
count   3.000000   2.0   3.000000   3.000000
mean   46.333333  60.0  73.333333  90.333333
std    10.969655   0.0   5.773503   0.577350
min    40.000000  60.0  70.000000  90.000000
25%    40.000000  60.0  70.000000  90.000000
50%    40.000000  60.0  70.000000  90.000000
75%    49.500000  60.0  75.000000  90.500000
max    59.000000  60.0  80.000000  91.000000

In [14]:
dataset = pd.read_csv('InvestmentDataset.csv')

In [15]:
dataset

   Year Profit Percentage  Additional Investment  Total Amount
0     1               25%                      0       6250.00
1     2              -30%                      0       4375.00
2     3               22%                      0       5337.50
3     4               28%                      0       6832.00
4     5               25%                   2000      10840.00
5     6                5%                      0      11382.00
6     7              -25%                      0       8536.50
7     8               30%                      0      11097.45
8     9              -22%                      0       8656.01
9    10               28%                      0      11079.69

In [16]:
dataset.dtypes

Year                       int64
Profit Percentage         object
Additional Investment      int64
Total Amount             float64
dtype: object

In [17]:
dataset_cal = pd.read_csv('calories.csv')

In [18]:
dataset_cal.head(10)
# dataset_cal.tail(10)

   Duration  Pulse  Maxpulse  Calories
0      60.0    110       130     409.1
1      60.0    117       145     479.0
2      60.0    103       135     340.0
3      45.0    109       175     282.4
4      45.0    117       148     406.0
5      60.0    102       127     300.0
6      60.0    110       136     374.0
7       NaN    104       134     253.3
8      30.0    109       133     195.1
9      60.0     98       124     269.0

In [19]:
dataset_cal.dropna()

     Duration  Pulse  Maxpulse  Calories
0        60.0    110       130     409.1
1        60.0    117       145     479.0
2        60.0    103       135     340.0
3        45.0    109       175     282.4
4        45.0    117       148     406.0
..        ...    ...       ...       ...
164      60.0    105       140     290.8
165      60.0    110       145     300.0
166      60.0    115       145     310.2
167      75.0    120       150     320.4
168      75.0    125       150     330.4

[163 rows x 4 columns]

In [20]:
dataset_cal.fillna(0).head(10)

   Duration  Pulse  Maxpulse  Calories
0      60.0    110       130     409.1
1      60.0    117       145     479.0
2      60.0    103       135     340.0
3      45.0    109       175     282.4
4      45.0    117       148     406.0
5      60.0    102       127     300.0
6      60.0    110       136     374.0
7       0.0    104       134     253.3
8      30.0    109       133     195.1
9      60.0     98       124     269.0

In [21]:
dataset_cal.iloc[17]

Duration     45.0
Pulse        90.0
Maxpulse    112.0
Calories      NaN
Name: 17, dtype: float64

In [22]:
decr_cal = dataset_cal.describe()

In [23]:
decr_cal

         Duration       Pulse    Maxpulse     Calories
count  168.000000  169.000000  169.000000   164.000000
mean    63.958333  107.461538  134.047337   375.790244
std     42.401185   14.510259   16.450434   266.379919
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   250.925000
50%     60.000000  105.000000  131.000000   318.600000
75%     60.000000  111.000000  141.000000   387.600000
max    300.000000  159.000000  184.000000  1860.400000

In [24]:
for column in dataset_cal.columns:
    dataset_cal[column].fillna(dataset_cal[column].mean(),inplace= True)

C:\Users\memon\AppData\Local\Temp\ipykernel_22548\1997185175.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset_cal[column].fillna(dataset_cal[column].mean(),inplace= True)

In [25]:
dataset_cal.iloc[17]

Duration     45.000000
Pulse        90.000000
Maxpulse    112.000000
Calories    375.790244
Name: 17, dtype: float64

In [26]:
dataset_cal.dtypes

Duration    float64
Pulse         int64
Maxpulse      int64
Calories    float64
dtype: object

In [27]:
dataset_cal.astype({"Duration": "str",'Pulse':'str'}).dtypes

Duration     object
Pulse        object
Maxpulse      int64
Calories    float64
dtype: object

In [47]:
student = [{"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"B"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":"Fail","Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"B"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"}]

In [48]:
std_df = pd.DataFrame(student)

In [49]:
# std_df['FinalMarks'].astype(float)
std_df.FinalMarks = pd.to_numeric(std_df['FinalMarks'],errors= 'coerce')

In [50]:
std_df.dtypes

Name           object
Fname          object
FinalMarks    float64
Grade          object
dtype: object

In [51]:
std_df.isnull().sum()

Name          0
Fname         0
FinalMarks    1
Grade         0
dtype: int64

In [52]:
std_df.dropna()
std_df.fillna(0, inplace=True)

In [53]:
std_df.FinalMarks.astype(int)

0    80
1    80
2     0
3    80
4    80
Name: FinalMarks, dtype: int64

In [54]:
std_df.iloc[-1,:]

Name          Ahmed
Fname           Ali
FinalMarks     80.0
Grade             A
Name: 4, dtype: object

In [57]:
std_df[std_df.Grade != 'A']

    Name Fname  FinalMarks Grade
1  Ahmed   Ali        80.0     B
3  Ahmed   Ali        80.0     B

In [58]:
std_df[['Name','Fname']]

    Name Fname
0  Ahmed   Ali
1  Ahmed   Ali
2  Ahmed   Ali
3  Ahmed   Ali
4  Ahmed   Ali

In [62]:
Name = std_df['Name']
Name[[1,2,4]]

1    Ahmed
2    Ahmed
4    Ahmed
Name: Name, dtype: object

In [63]:
std_df

    Name Fname  FinalMarks Grade
0  Ahmed   Ali        80.0     A
1  Ahmed   Ali        80.0     B
2  Ahmed   Ali         0.0     A
3  Ahmed   Ali        80.0     B
4  Ahmed   Ali        80.0     A

In [72]:
std_df.loc[[1,4],['Name','Fname']]

    Name Fname
1  Ahmed   Ali
4  Ahmed   Ali

In [73]:
std_df.iloc[:,]

    Name Fname  FinalMarks Grade
0  Ahmed   Ali        80.0     A
1  Ahmed   Ali        80.0     B
2  Ahmed   Ali         0.0     A
3  Ahmed   Ali        80.0     B
4  Ahmed   Ali        80.0     A

In [74]:
std_df.FinalMarks.mean()

np.float64(64.0)

In [76]:
std_df.describe()

       FinalMarks
count    5.000000
mean    64.000000
std     35.777088
min      0.000000
25%     80.000000
50%     80.000000
75%     80.000000
max     80.000000

In [78]:
std_df.Grade.value_counts()['A']

np.int64(3)

In [80]:
std_df.Grade.unique()

array(['A', 'B'], dtype=object)

In [109]:
student_data = pd.read_csv('students_five_classes.csv')

In [110]:
student_data.head()

         roll_no         name  exam1  exam2  final_exam
0  SMIT/DSAI/001  David Iqbal     20     16          35
1  SMIT/DSAI/002  Ahmed Ahmed     13      7          40
2  SMIT/DSAI/003   John Zahid     13     24          47
3  SMIT/DSAI/004  David Brown      0     15          24
4  SMIT/DSAI/005  Fatima Khan     20      8           6

In [111]:
student_data['obtain_marks'] = student_data.iloc[:,2:].sum(axis = 1)

In [112]:
student_data['total_marks'] = 100

In [113]:
student_data

,roll_no,name,exam1,exam2,final_exam,obtain_marks,total_marks
0,SMIT/DSAI/001,David Iqbal,20,16,35,71,100
1,SMIT/DSAI/002,Ahmed Ahmed,13,7,40,60,100
2,SMIT/DSAI/003,John Zahid,13,24,47,84,100
3,SMIT/DSAI/004,David Brown,0,15,24,39,100
4,SMIT/DSAI/005,Fatima Khan,20,8,6,34,100
...,...,...,...,...,...,...,...
495,SMIT/MAW/096,Sara Zahid,8,10,45,63,100
496,SMIT/MAW/097,Ayesha Ali,14,3,31,48,100
497,SMIT/MAW/098,Michael Brown,2,20,50,72,100
498,SMIT/MAW/099,Sara Malik,24,6,16,46,100
499,SMIT/MAW/100,Noor Ali,9,11,44,64,100

In [114]:
student_data['percentage'] = (student_data.obtain_marks / student_data.total_marks)*100

In [122]:
student_data.grades = student_data.percentage.apply(grade)

In [138]:
student_data['class'] = student_data['roll_no'].str.split('/').str[1]

In [118]:
def grade(marks):
    if marks>80:
        return 'A'
    elif marks>70:
        return 'B'
    elif marks>50:
        return 'C'
    else:
        return 'F'

In [155]:
for cl in student_data['class'].unique():
    print(f"class: {cl}")
    print('_'*10)
    std_cl = student_data[student_data['class'] == cl]
    print(std_cl.describe().loc['mean'])
    print(std_cl['grades'].value_counts())
    print('*'*50)

class: DSAI
__________
exam1            13.35
exam2            12.46
final_exam       24.08
obtain_marks     49.89
total_marks     100.00
percentage       49.89
Name: mean, dtype: float64
grades
F    50
C    38
B     8
A     4
Name: count, dtype: int64
**************************************************
class: DM
__________
exam1            13.08
exam2            13.95
final_exam       24.83
obtain_marks     51.86
total_marks     100.00
percentage       51.86
Name: mean, dtype: float64
grades
F    46
C    36
B    13
A     5
Name: count, dtype: int64
**************************************************
class: UIUX
__________
exam1            12.57
exam2            12.52
final_exam       23.88
obtain_marks     48.97
total_marks     100.00
percentage       48.97
Name: mean, dtype: float64
grades
F    58
C    28
B    10
A     4
Name: count, dtype: int64
**************************************************
class: GD
__________
exam1            13.05
exam2            13.46
final_exam       23.66
obtain_marks     50.17
total_marks     100.00
percentage       50.17
Name: mean, dtype: float64
grades
F    50
C    33
B    14
A     3
Name: count, dtype: int64
**************************************************
class: MAW
__________
exam1            12.08
exam2            13.56
final_exam       23.01
obtain_marks     48.65
total_marks     100.00
percentage       48.65
Name: mean, dtype: float64
grades
F    60
C    29
B     9
A     2
Name: count, dtype: int64
**************************************************